#ifndef BSQRT_H
#define BSQRT_H

/************************************************************/
/*  Функция извлечения квадратного корня из числа           */
/*                                                          */
/*  void Bsqrt(IN p_element value,                          */
/*             OUT p_element output);                       */
/*                                                          */
/*  Входные параметры:                                      */
/*                                                          */
/*  p_element value - число, из которого будет изъят        */
/*                    квадратный корень                     */
/*                                                          */
/*                                                          */
/*  Выходные параметры:                                     */
/*                                                          */
/*  p_element output - число, в которое будет помещен       */
/*                     результат извлечения корня           */
/*                                                          */
/************************************************************/

LIB(void) Bsqrt(IN p_element value, 
                OUT p_element output);

/************************************************************/
/*  Функция проверяет число на наличие точного корня        */
/*                                                          */
/*  void isSqrt(IN p_element value);                        */
/*                                                          */
/*  Входные параметры:                                      */
/*                                                          */
/*  p_element value - число, которое будет проверено на     */
/*                    наличие квадратного корня             */
/*                                                          */
/*  Возвращаемое значение:                                  */
/*                                                          */
/*  0   - точный корень не найден                           */
/*  1   - точный корень найден                              */
/*                                                          */
/************************************************************/

LIB(BOOL) isSqrt(IN p_element value);

#endif
