#ifndef BSUM_H
#define BSUM_H

/************************************************************/
/*  Функция сложения чисел                                  */
/*                                                          */
/*  void Sub(IN p_element valueL,                           */
/*           IN p_element valueM,                           */
/*           OUT p_element out);                            */
/*                                                          */
/*  Входные параметры:                                      */
/*                                                          */
/*  p_element valueL    - первое слагаемое                  */
/*  p_element valueM    - второе слагаемое                  */
/*                                                          */
/*  Выходные параметры:                                     */
/*                                                          */
/*  p_element out    - массив, в который будет помещен      */
/*                     результат сложения                   */
/*                                                          */
/************************************************************/

LIB(void) Sum(IN p_element valueL,
              IN p_element valueM,
              OUT p_element out);

/************************************************************/
/*  Функция прибвляет 1 к заданному числу                   */
/*                                                          */
/*  void Increment(IN OUT p_element valueL);                */
/*                                                          */
/*  Входные параметры:                                      */
/*                                                          */
/*  p_element valueL    - первое слагаемое                  */
/*                                                          */
/*  Выходные параметры:                                     */
/*                                                          */
/*  p_element valueL - массив, в который будет помещен      */
/*                     результат инкрементирования          */
/*                                                          */
/************************************************************/

LIB(void) Increment(IN OUT p_element valueL);

#endif