#ifndef COMPARE_H
#define COMPARE_H

/************************************************************/
/*	 ‘ункци€ сравнени€ двух чисел, заданных массивами слов	*/
/*															*/
/*	 int Compare(IN p_element valueL,						*/
/*				 IN p_element valueM,						*/
/*				 IN unsigned int sizeL,						*/
/*				 IN unsigned int sizeM);					*/
/*															*/
/*	¬ходные параметры:										*/
/*															*/
/*	p_element valueL 		- первый операнд				*/
/*	p_element valueM		- второй операнд				*/
/*	unsigned int  sizeL		- длина первого операнда		*/
/*	unsigned int  sizeM		- длина второго операнда		*/
/*															*/
/*	¬озвращаемое значение:									*/
/*															*/
/*	-1	- второй операнд больше первого операнда			*/
/*	 0	- первый и второй операнд равны						*/
/*	 1	- первый операнд больше второго операнда			*/
/*															*/
/************************************************************/

LIB(int) Compare(p_element valueL, p_element valueM, unsigned int sizeL, unsigned int sizeM);

/************************************************************/
/*	 ‘ункци€ сравени€ и замены чисел						*/
/*															*/
/*	 static BOOL CompareAndSwap(IN OUT p_element a,			*/
/*								IN OUT p_element b);		*/
/*															*/
/*	¬ходные параметры:										*/
/*															*/
/*	p_element a		- первое число							*/
/*	p_element b		- второе число							*/
/*															*/
/*	¬озвращаемое значение:									*/
/*															*/
/*	True, если была произведена замена, или False, если		*/
/*	замена не была произведена								*/
/*															*/
/*	«аметки:												*/
/*															*/
/*	- ≈сли b больше a, то a будет помещено					*/
/*	  в b, а b будет помещено в a							*/
/*	- ≈сли a больше b, то никаких изменений не будет		*/
/*	  произведено											*/
/*															*/
/************************************************************/

LIB(BOOL) CompareAndSwap(IN OUT p_element a,
						 IN OUT p_element b);

/************************************************************/
/*	 ‘ункци€ замены чисел									*/
/*															*/
/*	 static void Swap(IN OUT p_element a,					*/
/*				      IN OUT p_element b);					*/
/*															*/
/*	¬ходные параметры:										*/
/*															*/
/*	p_element a		- первое число							*/
/*	p_element b		- второе число							*/
/*															*/
/************************************************************/

LIB(void) Swap(IN OUT p_element a,
			   IN OUT p_element b);

#endif