#ifndef RAND_H
#define RAND_H

/************************************************************/
/*  Функция инициализации модуля получения случайных чисел  */
/*                                                          */
/*  LIB(void) randInit(IN long seed);                       */
/*                                                          */
/*  Входные параметры:                                      */
/*                                                          */
/*  long seed    - число, отвечающее за факт случайности    */
/*                 генерируемых чисел                       */
/*                                                          */
/************************************************************/

LIB(void) randInit(IN long seed);

/************************************************************/
/*  Функция генерации случайного числа                      */
/*                                                          */
/*  LIB(void) getRandomNumber(OUT p_element result);        */
/*                                                          */
/*  Выходные параметры:                                     */
/*                                                          */
/*  p_element result   - число, в которое будет помещено    */
/*                       сгенерированное случайное число    */
/*                                                          */
/************************************************************/

LIB(void) getRandomNumber(OUT p_element result);

/************************************************************/
/*  Функция генерации случайного числа                      */
/*                                                          */
/*  LIB(void) getRandomNumber2(OUT p_element result,        */
/*                             IN unsigned int size);       */
/*                                                          */
/*  Входные параметры:                                      */
/*                                                          */
/*  unsigned int size  - размер числа                       */
/*                                                          */
/*  Выходные параметры:                                     */
/*                                                          */
/*  p_element result   - число, в которое будет помещено    */
/*                       сгенерированное случайное число    */
/*                                                          */
/************************************************************/

LIB(void) getRandomNumber2(OUT p_element result,
                           IN unsigned int size);

/************************************************************/
/*  Функция генерации одного случайного элемента            */
/*                                                          */
/*  LIB(long) getOneRandom();                               */
/*                                                          */
/*  Возвращаемое значение:                                  */
/*                                                          */
/*  long randPart   - случайное число                       */
/*                                                          */
/************************************************************/

LIB(long) getOneRandom();

#endif
